Autodesk.Revit.UI.UIFabricationUtils.GetCanFinishChangeService(Autodesk.Revit.DB.Document)
Checks if Change Service can finish or not.
doc:
The document.
Returns:
Gets whether Change Service can finish or not.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.SetCanFinishChangeService(Autodesk.Revit.DB.Document,System.Boolean)
Sets if finishing Change Service is allowed or not.
doc:
The document.
canFinish:
Sets whether we can finish Change Service or not.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.SetServiceSwapOutShapeForMouseOver(Autodesk.Revit.DB.Document,System.Int32,Autodesk.Revit.DB.ConnectorProfileType)
Sets the shape information to select the elements in the model from moused-over shapes.
document:
The document.
serviceId:
The fabrication service identifier.
shape:
The shape of the parts to be selected.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.ServiceSwapOutPartTypeMouseOver(Autodesk.Revit.DB.Document,System.Int32)
Sets the required information to select the part types in the model from the moused-over fittings.
document:
The document.
partTypeId:
The part type Id. Pass -1 to select none.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.SetServiceSwapOutServiceIdForMouseOver(Autodesk.Revit.DB.Document,System.Int32)
Sets the service id to select the elements in the model from the moused-over service.
document:
The document.
serviceId:
The service id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.SetServiceSwapOutSizesForMouseOver(Autodesk.Revit.DB.Document,System.Int32,Autodesk.Revit.DB.ConnectorProfileType,System.Double,System.Double)
Sets the required information to select the elements in the model from the moused-over sizes.
document:
The document.
serviceId:
The fabrication service identifier.
profileType:
The shape of the parts to be selected.
widthOrDiameter:
The width or diameter of the parts to be selected.
depth:
The depth of the parts to be selected. Pass 0 if the profile type is Round.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.SetServiceSwapOutSizeMappings(Autodesk.Revit.DB.Document,System.Collections.Generic.ISet{Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap})
Sets the service swap out size mappings
document:
The document.
mappings:
The service swap out size mappings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.UI.UIFabricationUtils.SetServiceSwapOutPartTypeMappings(Autodesk.Revit.DB.Document,System.Collections.Generic.IDictionary{Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId})
Sets the service swap out part type mappings
document:
The document.
mappings:
The service swap out part type mappings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.UI.UIFabricationUtils.SetServiceGroupForSwapOut(Autodesk.Revit.DB.Document,System.Int32)
Sets the service group for service swap out.
document:
The document.
groupIndex:
The service group index.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.SetServiceForSwapOut(Autodesk.Revit.DB.Document,System.Int32)
Sets the service for service swap out.
document:
The document.
serviceId:
The service id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.SetupFabricationPrinters(Autodesk.Revit.DB.Document,System.Int32)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.SetFabricationPrinterToDefault(Autodesk.Revit.DB.Document,System.Int32)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.GetFabricationPrinterFile(Autodesk.Revit.DB.Document,System.Int32)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.SetupFabricationReports(Autodesk.Revit.DB.Document,Autodesk.Revit.FabricationReportType,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.PrintFabricationReports(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Returns:
returns if any reports were printed
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.EditConfiguration(Autodesk.Revit.DB.Document,System.String,System.String)
Returns:
returns if the configuration was changed
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.GetIsMPR(Autodesk.Revit.DB.Document)
Checks if starting MPR is currently active
doc:
The document.
Returns:
returns whether MPR is currently active
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.SetIsMPR(Autodesk.Revit.DB.Document,System.Boolean)
Sets if MPR is currently active or not.
doc:
The document.
isMPR:
sets whether MPR is valid for the current service group.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.GetCanMPR(Autodesk.Revit.DB.Document)
Checks if starting MPR is allowed or not.
doc:
The document.
Returns:
gets whether MPR is valid for the current service group.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.SetCanMPR(Autodesk.Revit.DB.Document,System.Boolean)
Sets if starting MPR is allowed or not.
doc:
The document.
canMPR:
sets whether MPR is valid for the current service group.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.RestartMPR(Autodesk.Revit.DB.Document)
Call to restart multi point routing service.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.RouteFabricationService(Autodesk.Revit.DB.Document,System.Int32,System.Int32)
Call to start routing fabrication service.
serviceId:
The Fabrication service.
groupIndex:
The Fabrication service group index.
Throws Autodesk.Revit.Exceptions.ArgumentException:
checks the service group is valid
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.SetCurrentServiceInfo(Autodesk.Revit.DB.Document,System.Int32,System.Int32)
call to initialise what service / group will be used if MPR command is initiated from outside the part browser.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016